{
  "id": "c13",
  "title": "Audyt Klauzuli 13: TIK zapewniające dostęp do usług przekaźnikowych lub alarmowych",
  "content": [
    {
      "type": "heading",
      "level": 3,
      "text": "C.13.1 Wymagania dotyczące usług przekazu"
    },
    {
      "type": "heading",
      "level": 4,
      "text": "C.13.1.1 Postanowienia ogólne"
    },
    {
      "type": "informative",
      "text": "Klauzula 13.1.1 ma charakter wyłącznie informacyjny i&nbsp;nie zawiera wymagań do testowania.\n"
    },
    {
      "type": "heading",
      "level": 4,
      "text": "C.13.1.2 Usługi przekazu w&nbsp;trybie tekstowym"
    },
    {
      "type": "test",
      "preconditions": [
        "1. Usługa polega na przekazywaniu tekstu."
      ],
      "procedure": [
        "1. Sprawdź, czy usługa umożliwia interakcję między użytkownikami tekstu"
      ],
      "form": {
        "inputs": [
          {
            "value": "Zaliczone",
            "label": "Kryterium 1: prawda"
          },
          {
            "value": "Niezaliczone",
            "label": "Kryterium 1: fałsz"
          },
          {
            "value": "Nie dotyczy",
            "label": "Nie spełniono warunku wstępnego 1."
          }
        ],
        "legend": "Wybierz wynik dla C.13.1.2 Usługi przekazu w&nbsp;trybie tekstowym",
        "noteId": "notes-c-13-1-2"
      },
      "evaluationType": "Inspection"
    },
    {
      "type": "heading",
      "level": 4,
      "text": "C.13.1.3 Usługi przekazu w&nbsp;trybie języka migowego"
    },
    {
      "type": "test",
      "preconditions": [
        "1. Usługa polega na przekazywaniu znaków migowych."
      ],
      "procedure": [
        "1. Sprawdź, czy usługa umożliwia interakcję między użytkownikami języka migowego a&nbsp;użytkownikami mowy poprzez konwersję między tymi dwoma trybami komunikacji."
      ],
      "form": {
        "inputs": [
          {
            "value": "Zaliczone",
            "label": "Kryterium 1: prawda"
          },
          {
            "value": "Niezaliczone",
            "label": "Kryterium 1: fałsz"
          },
          {
            "value": "Nie dotyczy",
            "label": "Nie spełniono warunku wstępnego 1."
          }
        ],
        "legend": "Wybierz wynik dla C.13.1.3 Usługi przekazu w&nbsp;trybie języka migowego",
        "noteId": "notes-c-13-1-3"
      },
      "evaluationType": "Inspection"
    },
    {
      "type": "heading",
      "level": 4,
      "text": "C.13.1.4 Usługi odczytu z&nbsp;ruchu warg"
    },
    {
      "type": "test",
      "preconditions": [
        "1. Usługa polega na czytaniu z&nbsp;ruchu warg."
      ],
      "procedure": [
        "1. Sprawdź, czy usługa umożliwia interakcję między użytkownikami czytającymi z&nbsp;ruchu warg a&nbsp;użytkownikami telefonu głosowego poprzez konwersję między tymi dwoma trybami komunikacji."
      ],
      "form": {
        "inputs": [
          {
            "value": "Zaliczone",
            "label": "Kryterium 1: prawda"
          },
          {
            "value": "Niezaliczone",
            "label": "Kryterium 1: fałsz"
          },
          {
            "value": "Nie dotyczy",
            "label": "Nie spełniono warunku wstępnego 1. EN 301 549 V3.2.1 (2021-03)"
          }
        ],
        "legend": "Wybierz wynik dla C.13.1.4 Usługi odczytu z&nbsp;ruchu warg",
        "noteId": "notes-c-13-1-4"
      },
      "evaluationType": "Inspection"
    },
    {
      "type": "heading",
      "level": 4,
      "text": "C.13.1.5 Usługi telefonii z&nbsp;napisami"
    },
    {
      "type": "test",
      "preconditions": [
        "1. Usługa jest usługą telefonii z&nbsp;napisami."
      ],
      "procedure": [
        "1. Sprawdź, czy usługa zapewnia użytkownikom niesłyszącym i&nbsp;słabosłyszącym korzystającym z&nbsp;telefonu możliwość aktywnego uczestniczenia w&nbsp;rozmowie dzięki wyświetlaniu napisów tekstowych tłumaczących przychodzącą część rozmowy."
      ],
      "form": {
        "inputs": [
          {
            "value": "Zaliczone",
            "label": "Kryterium 1: prawda"
          },
          {
            "value": "Niezaliczone",
            "label": "Kryterium 1: fałsz"
          },
          {
            "value": "Nie dotyczy",
            "label": "Nie spełniono warunku wstępnego 1."
          }
        ],
        "legend": "Wybierz wynik dla C.13.1.5 Usługi telefonii z&nbsp;napisami",
        "noteId": "notes-c-13-1-5"
      },
      "evaluationType": "Inspection"
    },
    {
      "type": "heading",
      "level": 4,
      "text": "C.13.1.6 Usługi przekazu mowy na mowę"
    },
    {
      "type": "test",
      "preconditions": [
        "1. Usługa jest usługą przekazywania mowy na mowę."
      ],
      "procedure": [
        "1. Sprawdź, czy usługa umożliwia użytkownikom telefonów z&nbsp;niepełnosprawnościami mowy lub z&nbsp;niepełnosprawnościami poznawczymi, językowymi i&nbsp;trudnościami w&nbsp;nauce oraz każdemu innemu użytkownikowi komunikowanie się, zapewniając wsparcie."
      ],
      "form": {
        "inputs": [
          {
            "value": "Zaliczone",
            "label": "Kryterium 1: prawda"
          },
          {
            "value": "Niezaliczone",
            "label": "Kryterium 1: fałsz"
          },
          {
            "value": "Nie dotyczy",
            "label": "Nie spełniono warunku wstępnego 1."
          }
        ],
        "legend": "Wybierz wynik dla C.13.1.6 Usługi przekazu mowy na mowę",
        "noteId": "notes-c-13-1-6"
      },
      "evaluationType": "Inspection"
    },
    {
      "type": "heading",
      "level": 3,
      "text": "C.13.2 Dostęp do usług przekazu informacji"
    },
    {
      "type": "test",
      "preconditions": [
        "1. System TIK obsługuje komunikację dwukierunkową.",
        "2. Został określony zestaw usług przekazywania do obsługi komunikacji dwukierunkowej."
      ],
      "procedure": [
        "1. Sprawdź, czy system nie uniemożliwia dostępu do tych usług przekazywania w&nbsp;odniesieniu do połączeń przychodzących i&nbsp;wychodzących."
      ],
      "form": {
        "inputs": [
          {
            "value": "Zaliczone",
            "label": "Kryterium 1: prawda"
          },
          {
            "value": "Niezaliczone",
            "label": "Kryterium 1: fałsz"
          },
          {
            "value": "Nie dotyczy",
            "label": "Nie spełniono warunku wstępnego 1 lub 2."
          }
        ],
        "legend": "Wybierz wynik dla C.13.2 Dostęp do usług przekazu informacji",
        "noteId": "notes-c-13-2"
      },
      "evaluationType": "Inspection"
    },
    {
      "type": "heading",
      "level": 3,
      "text": "C.13.3 Dostęp do usług awaryjnego przekazu informacji"
    },
    {
      "type": "test",
      "preconditions": [
        "1. System TIK obsługuje komunikację dwukierunkową.",
        "2. Został określony zestaw usług ratowniczych do obsługi komunikacji."
      ],
      "procedure": [
        "1. Sprawdź, czy system nie uniemożliwia dostępu do tych usług ratowniczych w&nbsp;odniesieniu do połączeń przychodzących i&nbsp;wychodzących. V3.2.1 grudzień 2020 zatwierdzania (EN)  AP 20210310: od 10-12-2020 do 10-03-2021 V3.2.1 marzec 2021 Publikacja Polski Komitet Normalizacyjny ul. Świętokrzyska 14, 00-050 War sza wa http://www.pkn.pl ISBN 978-83-8347-996-5"
      ],
      "form": {
        "inputs": [
          {
            "value": "Zaliczone",
            "label": "Kryterium 1: prawda"
          },
          {
            "value": "Niezaliczone",
            "label": "Kryterium 1: fałsz"
          },
          {
            "value": "Nie dotyczy",
            "label": "Nie spełniono warunku wstępnego 1 lub 2. EN 301 549 V3.2.1 (2021-03) Załącznik D (informacyjny): Dodatkowe materiały dotyczące dostępności poznawczej Nie ulega wątpliwości, że osoby z&nbsp;niepełnosprawnościami poznawczymi, językowymi i&nbsp;trudnościami w&nbsp;nauce mają zróżnicowane potrzeby i&nbsp;preferencje w&nbsp;zakresie dostępności oraz że istnieje potrzeba opracowania dalszych wytycznych i&nbsp;norm. Prowadzone są badania w&nbsp;tej dziedzinie. Odpowiednie prace normalizacyjne są obecnie podejmowane przez Inicjatywę Dostępności Sie - ci W3C (WAI). WAI pracuje nad poprawą wymagań i&nbsp;wskazówek technicznych dla programistów, aby lepiej zadbać o&nbsp;dostępność stron internetowych dla osób z&nbsp;niepełnosprawnościami poznawczymi, językowymi i&nbsp;trudnościami w&nbsp;nauce Aktualne działania W3C w&nbsp;tej dziedzinie można znaleźć na stronie https://www. w3.org/WAI/cognitive/. EN 301 549 V3.2.1 (2021-03) Załącznik E (informacyjny): Wskazówki dla użytkowników niniejszego dokumentu E.1 Wprowadzenie Załącznik objaśniający ma na celu umożliwienie użytkownikom tego dokumentu jak najlepsze korzystanie z&nbsp;niego. Początkowo norma była przeznaczona do celów związanych z&nbsp;zamówieniami publicznymi. Zakres został zmieniony i&nbsp;obecna wersja zawiera także minimalne wymagania dyrektywy (UE) w&nbsp;sprawie dostępności stron internetowych i&nbsp;mobilnych aplikacji organów sektora publicznego (dyrektywa 2016/2102 [i.28]). Norma EN 301 549 zawiera szeroki zakres wymagań dotyczących różnych rozwiązań TIK . Istnieją na przy- kład wymagania dotyczące funkcji, właściwości fizycznych i&nbsp;oprogramowania. Bez względu na to, czy jest się odpowiedzialnym za zamawianie, testowanie, planowanie, produkcję, utrzymanie czy raportowanie o&nbsp;dostępności, konieczne jest zrozumienie, które wymagania są istotne dla danego produktu lub usługi w&nbsp;konkretnej sytuacji lub kontekście. Testowanie pod kątem wymagań dostępności nie zawsze kończy się odpowiedzią „tak” lub „nie” . Czasami można znaleźć się w&nbsp;szarej strefie, gdzie równie ważne jest zrozumienie warunków wstępnych i&nbsp;poten- cjalnych alternatyw dla różnych grup użytkowników końcowych. Należy pamiętać, że dostępność jest związana z&nbsp;ludźmi. Przykłady wymienione w&nbsp;niniejszym załączniku mają wyłącznie charakter orientacyjny, a&nbsp;norma może być z&nbsp;powodzeniem stosowana na wiele różnych sposobów i&nbsp;w różnych warunkach. E.2 Zarys dokumentu Dokument składa się z&nbsp;czternastu rozdziałów i&nbsp;sześciu załączników. Rozdziały od 0 do 3  zawierają informacje ogólne, zakres normy, odnośniki do źródeł, definicje termi - nów i&nbsp;objaśnienia skrótowców. Zawarte są w&nbsp;nich liczne cenne informacje, jednak przeczytanie normy od A&nbsp;do Z&nbsp;może stanowić wyzwanie. Rozdział 4 obejmuje specyfikacje funkcjonalne, które są bezpośrednio związane z&nbsp;potrzebami użytkow- nika końcowego. Rozdział ten objaśnia, jaka funkcjonalność jest potrzebna, aby umożliwić użytkownikom końcowym lokalizowanie, identyfikowanie i&nbsp;obsługiwanie funkcji w&nbsp;technologii, bez względu na ich umiejętności. Jest on ważny, ponieważ można się z&nbsp;niego dowiedzieć, jakim trudnościom mają zaradzić wymagania dotyczące dostępności. Rozdziały od 5 do 13  stanowią faktyczne wymagania techniczne. Większość czytelników rozpoczyna lekturę od tego miejsca, ale Rozdział 4 może stanowić lepszy punkt wyjścia, umożliwiający właściwe zrozumienie, jak korzystać ze szczegółowych części technicznych. Wymagania techniczne obejmują wiele różnych rodzajów TIK podzielonych na osobne rozdziały, jednak zawsze warto zajrzeć do Rozdziału 5, ponieważ znajdują się w&nbsp;nim wymagania ogólne. Rozdziały 9, 10 i&nbsp;11 są najbardziej istotne z&nbsp;punktu widzenia dyrektywy (UE) w&nbsp;sprawie dostępności stron internetowych i&nbsp;mobilnych aplikacji organów sektora publicznego [i.28]. Obejmują one strony in- ternetowe, dokumenty i&nbsp;aplikacje. Obowiązują jednak wymagania zawarte w&nbsp;innych rozdziałach, które wymieniono w&nbsp;tablicach w&nbsp;Załączniku A. EN 301 549 V3.2.1 (2021-03) Rozdział 14 dotyczy zgodności z&nbsp;normą EN 301 549 jako całością oraz z&nbsp;poszczególnymi wymaganiami. Załącznik A&nbsp;opisuje, w&nbsp;jaki sposób norma odnosi się do dyrektywy (UE) w&nbsp;sprawie dostępności stron internetowych i&nbsp;mobilnych aplikacji organów sektora publicznego [i.28]. Poza wymaganiami minimalnymi wymienionymi w&nbsp;Rozdziałach 9, 10 i&nbsp;11, niektóre z&nbsp;wymagań zawartych w&nbsp;Rozdziałach 5, 6, 7 i&nbsp;12 mogą w&nbsp;określonych sytuacjach być istotne dla wypełnienia postanowień dyrektywy. Tablice zamieszczone w&nbsp;Załączniku A&nbsp;pokazują, które z&nbsp;wymagań warto wziąć pod uwagę. W&nbsp;Załączniku B opisano, w&nbsp;jaki sposób specyfikacje funkcjonalne z&nbsp;Rozdziału 4 odnoszą się do wymagań technicznych zawartych w&nbsp;Rozdziałach 5 do13. Jest to przydatne narzędzie, które ułatwi np. wykorzy - stanie normy w&nbsp;zamówieniach publicznych podczas porównywania ofert w&nbsp;celu określenia wpływu, jaki określone wymagania mają na użytkowników końcowych. W&nbsp;Załączniku C opisano, w&nbsp;jaki sposób można sprawdzić, czy poszczególne wymagania normy zostały spełnione. Załącznik nie zawiera metodologii testowania i&nbsp;aby z&nbsp;powodzeniem z&nbsp;niego korzystać, potrzebna jest znaczna wiedza na temat specyfikacji funkcjonalnych i&nbsp;procedur testowania. Załącznik D zawiera odnośnik do dodatkowych materiałów dotyczących dostępności poznawczej. Załącznik E jest tym, co właśnie czytasz. Załącznik F zawiera tablicę historii zmian. E.3 Rozdział 4 Rozdział 4 jest w&nbsp;pewnym sensie rdzeniem normy. Użytkownicy końcowi, z&nbsp;ich różnymi potrzebami, są powodem, dla którego dostępność ma znaczenie. Potrzeby użytkowników, które leżą u&nbsp;podstaw każ- dej specyfikacji funkcjonalnej, są również przyczyną każdego z&nbsp;wymagań zawartych w&nbsp;tym dokumencie. Rozdział 4 nie zawiera żadnych wymagań jako takich, a&nbsp;jedynie opisy. Może to sprawiać wrażenie, że jest on mniej ważny, ale w&nbsp;rzeczywistości jest na odwrót. Celem całej normy jest zapewnienie możliwości korzystania z&nbsp;produktów i&nbsp;usług przez użytkowników końcowych o&nbsp;zróżnicowanych zdolnościach opi- sanych w&nbsp;tym rozdziale. W&nbsp;tym rozdziale przedstawiono dziesięć specyfikacji funkcjonalnych opartych na różnych rodzajach nie- pełnosprawności oraz opisano ochronę prywatności. Niepełnosprawności mogą mieć charakter trwały, czasowy lub sytuacyjny. Użytkownicy końcowi z&nbsp;wieloma niepełnosprawnościami mogą potrzebować określonych kombinacji rozwiązań w&nbsp;zakresie dostępności. Z&nbsp;tego względu konieczne jest uwzględnienie wszystkich różnych specyfikacji funkcjonalnych, a&nbsp;także ich kombinacji. Głównym założeniem normy jest wykorzystanie technologii do rozwiązywania problemów, z&nbsp;jakimi mogą borykać się użytkownicy końcowi. Dostępność można również postrzegać jako alternatywne sposoby korzystania z&nbsp;technologii. Na przykład: jeśli użytkownik końcowy nie ma zdolności widzenia, technolo- gia może przekazać mu dźwięk. Jeśli użytkownik końcowy nie ma zdolności słyszenia, technologia może dostarczyć tekst. Zostało to szczegółowo opisane w&nbsp;Rozdziale 4 dla każdej grupy użytkowników. Po przeczytaniu Rozdziału 4 można znacznie lepiej zrozumieć logikę wymagań zawartych w&nbsp;normie. EN 301 549 V3.2.1 (2021-03) E.4 Jak korzystać z&nbsp;normy E.4.1 Wymagania samowystarczalne Wymagania zawarte w&nbsp;dokumencie są określane mianem samodzielnych. Oznacza to, że składają się one z&nbsp;dwóch części; pierwsza część jest warunkiem wstępnym dla drugiej części, która zawiera właściwe wymaganie. Jeśli pierwsza część jest prawdziwa, należy spełnić drugą część wymagania. Jeśli pierwsza część jest nieprawdziwa, oznacza to, że wymaganie nie ma zastosowania. Na przykład wymaganie „Jeśli sprzęt TIK ma wyjście mowy, należy zapewnić [...]” można spełnić na dwa sposoby: • jeśli produkt lub usługa zapewnia mowę, należy spełnić drugą część wymagania; • jeśli produkt lub usługa nie zapewniają mowy, nie ma potrzeby zajmowania się drugą częścią wymagania. W&nbsp;takim przypadku wymaganie nie ma zastosowania. Spełnienie normy oznacza, że spełnione są wszystkie odpowiednie wymagania określone w&nbsp;tej normie. Aby uzyskać ogólny zarys wymagań w&nbsp;zakresie produktu lub usługi, można skupić się na wymaganiach z&nbsp;tymi samymi stwierdzeniami dotyczącymi zakresu. Istnieją narzędzia internetowe, które mogą pomóc w&nbsp;wyodrębnieniu wymagań, które są spełniane automatycznie. E.4.2 Związek między wymaganiami a&nbsp;specyfikacjami funkcjonalnymi Tablica zawarta w&nbsp;Załączniku B pomaga zrozumieć związek między wymaganiami a&nbsp;specyfikacjami funk- cjonalnymi. Instrukcja korzystania z&nbsp;tablicy znajduje się w&nbsp;Rozdziale B.2. Przed podjęciem decyzji o&nbsp;wyborze najbardziej odpowiedniego rozwiązania należy również zastanowić się nad kontekstem. Oto kilka przykładów. • W&nbsp;jakiej sytuacji ma być zastosowane rozwiązanie? • Które z&nbsp;niespełnionych wymagań można zrekompensować innymi opcjami, takimi jak np. centrum obsługi? • Ile kosztowałoby rozwiązanie problemu za pomocą takiej opcji? • Czy wymagania, które nie zostały spełnione, będzie można poprawić w&nbsp;kolejnej wersji rozwiązania? Dostawcy mogą wykazać, w&nbsp;jaki sposób ich produkty lub usługi spełniają wymagania dotyczące specyfi- kacji funkcjonalnych zawarte w&nbsp;Rozdziale 4, a&nbsp;także wymagania zawarte w&nbsp;Rozdziałach od 5 do 13. Może to pomóc w&nbsp;wyborze najbardziej odpowiedniego produktu lub usługi. EN 301 549 V3.2.1 (2021-03) E.5 Dyrektywa (UE) w&nbsp;sprawie dostępności stron internetowych i&nbsp;mobilnych aplikacji organów sektora publicznego [i.28] Dyrektywa (UE) w&nbsp;sprawie dostępności stron internetowych i&nbsp;mobilnych aplikacji organów sektora publicz- nego (Dyrektywa 2016/2102[i.28]) jest dyrektywą o&nbsp;minimalnej harmonizacji. Oznacza to, że wszystkie państwa członkowskie UE i&nbsp;kraje EFTA są zobowiązane co najmniej do spełnienia minimalnych wymagań, o&nbsp;których mowa w&nbsp;dyrektywie. Każdy kraj może zdecydować się na wykroczenie poza te wymagania w&nbsp;swoim ustawodawstwie krajowym, zarówno jeśli chodzi o&nbsp;wymagania, jak i&nbsp;zakres. Dyrektywa obejmuje, jako minimum, organy sektora publicznego oraz niektóre organizacje będące wła- snością rządu, finansowane lub kierowane przez rząd."
          }
        ],
        "legend": "Wybierz wynik dla C.13.3 Dostęp do usług awaryjnego przekazu informacji",
        "noteId": "notes-c-13-3"
      },
      "evaluationType": "Inspection",
      "notes": [
        "Definicja podmiotu sektora publicznego odnosi się do dyrektywy w&nbsp;sprawie zamówień pu - blicznych (dyrektywa 2014/24/UE [i.40]) art. 2 ust. 1 pkt 4, który definiuje „podmiot prawa publicznego” jako podmiot, który ma wszystkie poniższe cechy: • został utworzony w&nbsp;konkretnym celu zaspokajania potrzeb w&nbsp;interesie ogólnym, które nie mają charakteru przemysłowego ani handlowego; • ma osobowość prawną oraz • jest finansowany w&nbsp;przeważającej części przez państwo, władze regionalne lub lokalne lub inne podmioty prawa publicznego; bądź jego zarząd podlega nadzorowi ze strony tych władz lub podmiotów; bądź ponad połowa członków jego organu administrującego, zarządzającego lub nadzorczego została wyznaczona przez państwo, władze regionalne lub lokalne, lub przez inne podmioty prawa publicznego. Większość wymagań związanych z&nbsp;dyrektywą (UE) w&nbsp;sprawie dostępności stron internetowych i&nbsp;mobil- nych aplikacji organów sektora publicznego znajduje się w&nbsp;Rozdziałach 9, 10 i&nbsp;11, które dotyczą stron internetowych, dokumentów i&nbsp;oprogramowania. Pełna lista wymagań znajduje się w&nbsp;tablicach zawartych w&nbsp;Załączniku A. Dyrektywa obejmuje również intranety i&nbsp;ekstranety, które mają spełniać wymagania zawarte w&nbsp;Rozdziale 9 dotyczącym treści internetowej oraz w&nbsp;Rozdziale 10 dotyczącym dokumentów. Istnieją różne okresy karencji dla różnych rodzajów treści, a&nbsp;także wyjątki od tego, jakie treści są objęte dyrektywą. Na przykład, dyrektywa nie uwzględnia transmisji wideo na żywo. Oznacza to, że wymaga - nia 9.1.2.4 dla stron internetowych, 10.1.2.4 dla dokumentów i&nbsp;11.1.2.4 dla aplikacji nie mają wpływu na spełnienie wymagań dyrektywy. Należy pamiętać, że dyrektywa zawiera także inne wymagania, np. dotyczące monitorowania i&nbsp;oświadczeń o&nbsp;dostępności. Nie są one ujęte w&nbsp;normie EN 301 549. E.6 Załącznik D: Dodatkowe materiały dotyczące dostępności poznawczej W&nbsp;Załączniku D podano odnośnik do zasobów W3C, które można wykorzystać jako wytyczne w&nbsp;celu poprawy uwzględniania dostępności dla osób z&nbsp;niepełnosprawnościami poznawczymi, językowymi i&nbsp;trudnościami w&nbsp;nauce podczas korzystania z&nbsp;produktów i&nbsp;usług TIK . EN 301 549 V3.2.1 (2021-03) Załącznik F (informacyjny): Historia zmian Wersja Informacje o&nbsp;zmianach 2.1.2 Pierwsza publikacja w&nbsp;formie normy zharmonizowanej. 3.1.1 Zmieniono i&nbsp;rozszerzono wymagania dotyczące tekstu w&nbsp;czasie rzeczywistym (RTT) zawarte w&nbsp;Rozdziale 6.2. 3.1.1 Kryteria sukcesu WCAG 2.1 – AAA, które wcześniej znajdowały się w&nbsp;Załączniku D, są teraz zawarte w&nbsp;Rozdziale 9.5. 3.1.1 Dodano nowy Załącznik D „Dodatkowe materiały dotyczące dostępności poznawczej” . 3.1.1 Dodano nowy Załącznik E „Wskazówki dla użytkowników niniejszego dokumentu” . 3.2.1 Dodano nowy Załącznik F „Historia zmian” (niniejszy załącznik). EN 301 549 V3.2.1 (2021-03) Historia Historia dokumentu V1.1.1 luty 2014 Publikacja V1.1.2 kwiecień 2015 Publikacja V2.1.2 sierpień 2018 Publikacja V3.1.1 listopad 2019 Publikacja"
      ]
    }
  ]
}